; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	image1 - mode
	thermograph3 - mode
	thermograph0 - mode
	thermograph2 - mode
	Star2 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star1 - direction
	GroundStation5 - direction
	Star0 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image1)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument2 image1)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument3 image1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star6)
	(supports instrument4 thermograph2)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 Star1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation5)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 GroundStation5)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star6)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon8)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(pointing satellite3 Phenomenon10)
	(have_image Phenomenon7 image1)
	(have_image Phenomenon8 thermograph0)
	(have_image Phenomenon9 thermograph0)
	(have_image Phenomenon10 thermograph2)
))

)

; plan
1. (turn_to satellite3 star6 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 star6)
   goals met: 0 of 6
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 6
3. (calibrate satellite3 instrument6 star6)
   added: (calibrated instrument6)
   goals met: 0 of 6
4. (turn_to satellite3 phenomenon8 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 phenomenon8)
   goals met: 0 of 6
5. (turn_to satellite2 star6 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 star6)
   goals met: 0 of 6
6. (take_image satellite3 phenomenon8 instrument6 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 1 of 6
7. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 1 of 6
8. (calibrate satellite2 instrument3 star6)
   added: (calibrated instrument3)
   goals met: 1 of 6
9. (turn_to satellite0 groundstation4 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation4)
   goals met: 2 of 6
10. (turn_to satellite2 phenomenon10 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 phenomenon10)
   goals met: 2 of 6
11. (take_image satellite2 phenomenon10 instrument3 thermograph2)
   added: (have_image phenomenon10 thermograph2)
   goals met: 3 of 6
12. (turn_to satellite2 phenomenon7 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon7)
   goals met: 3 of 6
13. (take_image satellite2 phenomenon7 instrument3 image1)
   added: (have_image phenomenon7 image1)
   goals met: 4 of 6
14. (turn_to satellite3 phenomenon9 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 phenomenon9)
   goals met: 4 of 6
15. (take_image satellite3 phenomenon9 instrument6 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 5 of 6
16. (turn_to satellite3 phenomenon10 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 phenomenon10)
   goals met: 6 of 6
